In [2]:
import numpy as np
import pandas as pd

df1 = pd.read_csv("cars1.csv", encoding='ISO-8859-1')
df1.head()

       Make      Model  Year       Km Transmission Fuel    Price
0     Chery   Arrizo 5  2020   77,000    automatic  gas  355,000
1   Hyundai  Accent RB  2017   95,000    automatic  gas  400,000
2       Kia     Cerato  2016  106,000    automatic  gas  415,000
3  Chrysler        300  2006  155,000    automatic  gas  650,000
4     Dodge    Charger  2010   80,000    automatic  gas  800,000

In [3]:
df = df1.copy()

In [4]:
df.head()

       Make      Model  Year       Km Transmission Fuel    Price
0     Chery   Arrizo 5  2020   77,000    automatic  gas  355,000
1   Hyundai  Accent RB  2017   95,000    automatic  gas  400,000
2       Kia     Cerato  2016  106,000    automatic  gas  415,000
3  Chrysler        300  2006  155,000    automatic  gas  650,000
4     Dodge    Charger  2010   80,000    automatic  gas  800,000

In [5]:
df.tail()

       Make Model  Year    Km Transmission  Fuel Price
20124  None  None  None  None         None  None  None
20125  None  None  None  None         None  None  None
20126  None  None  None  None         None  None  None
20127  None  None  None  None         None  None  None
20128  None  None  None  None         None  None  None

In [6]:
df.shape

(20129, 7)

In [7]:
#Exploring the None Values
newdf = df[df['Km'] == 'None'] 
newdf

       Make Model  Year    Km Transmission  Fuel Price
6220   None  None  None  None         None  None  None
19954  None  None  None  None         None  None  None
19955  None  None  None  None         None  None  None
19956  None  None  None  None         None  None  None
19957  None  None  None  None         None  None  None
19958  None  None  None  None         None  None  None
19959  None  None  None  None         None  None  None
19960  None  None  None  None         None  None  None
19961  None  None  None  None         None  None  None
20122  None  None  None  None         None  None  None
20123  None  None  None  None         None  None  None
20124  None  None  None  None         None  None  None
20125  None  None  None  None         None  None  None
20126  None  None  None  None         None  None  None
20127  None  None  None  None         None  None  None
20128  None  None  None  None         None  None  None

In [8]:
#Replacing None with null values
df.replace(to_replace=['None'], value=np.nan, inplace=True)

In [9]:
df.isnull().sum()

Make            16
Model           16
Year            17
Km              16
Transmission    16
Fuel            16
Price           16
dtype: int64

In [10]:
#Dropping rows with null values in "price" column
df.dropna(subset=["Price"], axis=0, inplace=True)
df.isnull().sum()

Make            0
Model           0
Year            1
Km              0
Transmission    0
Fuel            0
Price           0
dtype: int64

In [11]:
#drop null year
df.dropna(subset=["Year"], axis=0, inplace=True)
df.isnull().sum()

Make            0
Model           0
Year            0
Km              0
Transmission    0
Fuel            0
Price           0
dtype: int64

In [12]:
print(df.dtypes)

Make            object
Model           object
Year            object
Km              object
Transmission    object
Fuel            object
Price           object
dtype: object

In [13]:
df.head()

       Make      Model  Year       Km Transmission Fuel    Price
0     Chery   Arrizo 5  2020   77,000    automatic  gas  355,000
1   Hyundai  Accent RB  2017   95,000    automatic  gas  400,000
2       Kia     Cerato  2016  106,000    automatic  gas  415,000
3  Chrysler        300  2006  155,000    automatic  gas  650,000
4     Dodge    Charger  2010   80,000    automatic  gas  800,000

In [14]:
#Fixing number formats
df['Price'] = df['Price'].str.replace(',', '', regex=True)

In [15]:
#Replacing any text with 0
#Changing column data type to float
df['Price'] = df['Price'].str.replace('\W', '0', regex=True).str.replace('[A-Za-z]', '0', regex=True).astype(float)

In [16]:
#Statistical summary of the column
df['Price'].describe()

count    2.011200e+04
mean     4.135929e+05
std      4.611212e+05
min      0.000000e+00
25%      1.550000e+05
50%      3.175000e+05
75%      5.000000e+05
max      1.000000e+07
Name: Price, dtype: float64

In [17]:
#Repeating the proccess for KM column
df['Km'] = df['Km'].str.replace(',', '', regex=True)

In [18]:
df['Km'] = df['Km'].str.replace('\W', '0', regex=True).str.replace('[A-Za-z]', '0', regex=True).astype(float)

In [19]:
df['Km'].describe()

count    2.011200e+04
mean     1.158853e+05
std      1.788791e+05
min      0.000000e+00
25%      4.000000e+04
50%      1.000000e+05
75%      1.700000e+05
max      1.000000e+07
Name: Km, dtype: float64

In [20]:
df['Year'] = df['Year'].astype(float)

In [21]:
df['Year'].describe()

count    20112.000000
mean      2011.783463
std         10.331298
min       1880.000000
25%       2008.000000
50%       2015.000000
75%       2020.000000
max       2024.000000
Name: Year, dtype: float64

In [22]:
print(df.dtypes)

Make             object
Model            object
Year            float64
Km              float64
Transmission     object
Fuel             object
Price           float64
dtype: object

In [23]:
df[df==0].count()

Make               0
Model              0
Year               0
Km              1635
Transmission       0
Fuel               0
Price             28
dtype: int64

In [24]:
#Drop any empty price value
df= df[df['Price'] != 0]
df[df==0].count()

Make               0
Model              0
Year               0
Km              1629
Transmission       0
Fuel               0
Price              0
dtype: int64

In [25]:
df1 = df[(df['Km']==0)&(df['Year'] < 2023)]
df1

        Make    Model    Year   Km Transmission Fuel     Price
64      Opel   Vectra  1995.0  0.0       manual  gas   75000.0
66      Ford   Escort  1999.0  0.0       manual  gas   70000.0
101      BMW      518  1984.0  0.0       manual  gas   70000.0
103    Skoda  Felicia  1995.0  0.0       manual  gas   70000.0
130    Mazda      929  1980.0  0.0       manual  gas   35000.0
...      ...      ...     ...  ...          ...  ...       ...
19929   Fiat      128  1980.0  0.0       manual  gas   40000.0
19932    Kia    Pride  1999.0  0.0       manual  gas   58000.0
19939  Skoda  Felicia  1995.0  0.0       manual  gas   45000.0
19944   Lada     1200  1983.0  0.0       manual  gas   25000.0
19950  Chery    Tiggo  2011.0  0.0       manual  gas  130000.0

[1598 rows x 7 columns]

In [26]:
#Replace unknown KM values with the mean of KM value for cars from the same year
#if the car is before 2024-2023
#i.e. for a 2022 model >> 2022 cars average KM 

#cars with 0 KM entry:
years = df1['Year'].unique().tolist()
indexes = df1.index.values.tolist()

#fixing the entries
for y in years :
    df2 = df[df['Year']==y]
    mean = df2["Km"].mean(axis=0)
    for i in indexes :
        if i in df2.index.values.tolist() :
            df.loc[i,['Km']] = [mean]

In [27]:
#Replacing unknown KM entries from the year 2023 and above with a random low number

from random import randint
df1 = df[(df['Km']==0)&(df['Year'] > 2022)]
indexes = df1.index.values.tolist()

for i in indexes :
    df.loc[i,['Km']] = [randint(1000,5000)]

In [28]:
df[df==0].count()

Make            0
Model           0
Year            0
Km              8
Transmission    0
Fuel            0
Price           0
dtype: int64

In [29]:
#Drop any empty KM value
df= df[df['Km'] != 0]
df[df==0].count()

Make            0
Model           0
Year            0
Km              0
Transmission    0
Fuel            0
Price           0
dtype: int64

In [30]:
df.describe()

               Year            Km         Price
count  20076.000000  2.007600e+04  2.007600e+04
mean    2011.802799  1.244430e+05  4.143214e+05
std       10.256011  1.764577e+05  4.612127e+05
min     1951.000000  1.000000e+00  1.000000e+00
25%     2008.000000  5.600000e+04  1.550000e+05
50%     2015.000000  1.110000e+05  3.200000e+05
75%     2020.000000  1.724041e+05  5.000000e+05
max     2024.000000  1.000000e+07  1.000000e+07

In [31]:
df.shape

(20076, 7)

In [32]:
df.to_csv("first-step.csv",index=False)